maxgerhardt/pio-electroniccats-samd/boards.txt
electroniccats_nfc_copy_cat.name=Electronic Cats NCF Copy Cat
electroniccats_nfc_copy_cat.vid.0=0x1209
electroniccats_nfc_copy_cat.pid.0=0xBAB8
electroniccats_nfc_copy_cat.vid.1=0x1209
electroniccats_nfc_copy_cat.pid.1=0xBAB8
electroniccats_nfc_copy_cat.upload.tool=bossac
electroniccats_nfc_copy_cat.upload.protocol=sam-ba
electroniccats_nfc_copy_cat.upload.maximum_size=262144
electroniccats_nfc_copy_cat.upload.offset=0x2000
electroniccats_nfc_copy_cat.upload.use_1200bps_touch=true
electroniccats_nfc_copy_cat.upload.wait_for_upload_port=true
electroniccats_nfc_copy_cat.upload.native_usb=true
electroniccats_nfc_copy_cat.build.mcu=cortex-m0plus
electroniccats_nfc_copy_cat.build.mathlib=arm_cortexM0l_math
electroniccats_nfc_copy_cat.build.f_cpu=48000000L
electroniccats_nfc_copy_cat.build.usb_product="NFC Copy Cat"
electroniccats_nfc_copy_cat.build.usb_manufacturer="Electronic Cats"
electroniccats_nfc_copy_cat.build.board=nfc_copy_cat
electroniccats_nfc_copy_cat.build.core=arduino
electroniccats_nfc_copy_cat.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_nfc_copy_cat.build.ldscript=flash_256KB.ld
electroniccats_nfc_copy_cat.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_nfc_copy_cat.build.variant=nfc_copy_cat
electroniccats_nfc_copy_cat.build.variant_system_lib=
electroniccats_nfc_copy_cat.build.vid=0x1209
electroniccats_nfc_copy_cat.build.pid=0xBAB8
electroniccats_nfc_copy_cat.bootloader.tool=openocd
electroniccats_nfc_copy_cat.bootloader.file=nfc_copy_cat/bootloader-nfc_copy_cat-v2.0.0.bin
electroniccats_nfc_copy_cat.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_nfc_copy_cat.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_nfc_copy_cat.menu.float.print=Print uses separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.float.string=String uses separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.float.both=Print & String use separate singles and doubles
electroniccats_nfc_copy_cat.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_nfc_copy_cat.menu.config.disabled=config.h disabled
electroniccats_nfc_copy_cat.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_nfc_copy_cat.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_nfc_copy_cat.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_nfc_copy_cat.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_nfc_copy_cat.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_nfc_copy_cat.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_nfc_copy_cat.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_nfc_copy_cat.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_nfc_copy_cat.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_nfc_copy_cat.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_nfc_copy_cat.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_nfc_copy_cat.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_nfc_copy_cat.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_nfc_copy_cat.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_nfc_copy_cat.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_nfc_copy_cat.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_nfc_copy_cat.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_nfc_copy_cat.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_nfc_copy_cat.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_nfc_copy_cat.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_nfc_copy_cat.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_nfc_copy_cat.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_nfc_copy_cat.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_nfc_copy_cat.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_nfc_copy_cat.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_nfc_copy_cat.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_nfc_copy_cat.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_nfc_copy_cat.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_nfc_copy_cat.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_nfc_copy_cat.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.tool=bossac
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_nfc_copy_cat.menu.bootloader.8kb.upload.native_usb=true
electroniccats_nfc_copy_cat.menu.usb.cdc=CDC_ONLY
electroniccats_nfc_copy_cat.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_nfc_copy_cat.menu.usb.cdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.cdc_hid=CDC_HID
electroniccats_nfc_copy_cat.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_nfc_copy_cat.menu.usb.cdc_hid.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.withcdc=WITH_CDC
electroniccats_nfc_copy_cat.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_nfc_copy_cat.menu.usb.withcdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.hid=HID_ONLY
electroniccats_nfc_copy_cat.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_nfc_copy_cat.menu.usb.hid.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.nocdc=WITHOUT_CDC
electroniccats_nfc_copy_cat.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_nfc_copy_cat.menu.usb.nocdc.build.pid=0xBAB8
electroniccats_nfc_copy_cat.menu.usb.none=USB_DISABLED
electroniccats_nfc_copy_cat.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_nfc_copy_cat.menu.usb.none.build.pid=0xBAB8

# Magspoof v3 based on D11C14A (SOIC-14)
electroniccats_magspoofv3.name= Magspoof V3
electroniccats_magspoofv3.vid.0=0x1209
electroniccats_magspoofv3.pid.0=0xBAB5
electroniccats_magspoofv3.vid.1=0x1209
electroniccats_magspoofv3.pid.1=0xBAB5
electroniccats_magspoofv3.vid.2=0x1209
electroniccats_magspoofv3.pid.2=0xBAB5
electroniccats_magspoofv3.vid.3=0x1209
electroniccats_magspoofv3.pid.3=0xBAB5
electroniccats_magspoofv3.vid.4=0x1209
electroniccats_magspoofv3.pid.4=0xBAB5
electroniccats_magspoofv3.vid.5=0x1209
electroniccats_magspoofv3.pid.5=0xBAB5
electroniccats_magspoofv3.build.mcu=cortex-m0plus
electroniccats_magspoofv3.build.mathlib=arm_cortexM0l_math
electroniccats_magspoofv3.build.f_cpu=48000000L
electroniccats_magspoofv3.build.usb_product="Magspoof V3"
electroniccats_magspoofv3.build.usb_manufacturer="Electronic Cats"
electroniccats_magspoofv3.build.board=SAMD_ZERO
electroniccats_magspoofv3.build.core=arduino
electroniccats_magspoofv3.build.variant=magspoofv3
electroniccats_magspoofv3.build.variant_system_lib=
electroniccats_magspoofv3.build.vid=0x1209
electroniccats_magspoofv3.upload.protocol=sam-ba
electroniccats_magspoofv3.bootloader.tool=arduino:openocd
electroniccats_magspoofv3.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_magspoofv3.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_magspoofv3.menu.float.print=Print uses separate singles and doubles
electroniccats_magspoofv3.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_magspoofv3.menu.float.string=String uses separate singles and doubles
electroniccats_magspoofv3.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_magspoofv3.menu.float.both=Print & String use separate singles and doubles
electroniccats_magspoofv3.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_magspoofv3.menu.config.disabled=config.h disabled
electroniccats_magspoofv3.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_magspoofv3.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_magspoofv3.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_magspoofv3.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_magspoofv3.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_magspoofv3.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_magspoofv3.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_magspoofv3.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_magspoofv3.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_magspoofv3.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_magspoofv3.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_magspoofv3.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_magspoofv3.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_magspoofv3.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_magspoofv3.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_magspoofv3.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_magspoofv3.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_magspoofv3.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_magspoofv3.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_magspoofv3.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_magspoofv3.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_magspoofv3.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_magspoofv3.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_magspoofv3.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_magspoofv3.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_magspoofv3.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_magspoofv3.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_magspoofv3.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_magspoofv3.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_magspoofv3.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_magspoofv3.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_magspoofv3.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_magspoofv3.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_magspoofv3.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_magspoofv3.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags} -DARM_MATH_CM0PLUS
electroniccats_magspoofv3.build.ldscript=flash_16KB.ld
electroniccats_magspoofv3.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
electroniccats_magspoofv3.bootloader.file=magspoofV3/sam_ba_magspoof_SAMD11C14A.bin
electroniccats_magspoofv3.menu.bootloader.4kb=4KB_BOOTLOADER
electroniccats_magspoofv3.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
electroniccats_magspoofv3.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
electroniccats_magspoofv3.menu.bootloader.4kb.upload.tool=bossac
electroniccats_magspoofv3.menu.bootloader.4kb.upload.use_1200bps_touch=true
electroniccats_magspoofv3.menu.bootloader.4kb.upload.wait_for_upload_port=true
electroniccats_magspoofv3.menu.bootloader.4kb.upload.native_usb=true
electroniccats_magspoofv3.menu.bootloader.4kb.upload.maximum_size=12288
electroniccats_magspoofv3.menu.bootloader.0kb=NO_BOOTLOADER
electroniccats_magspoofv3.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
electroniccats_magspoofv3.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
electroniccats_magspoofv3.menu.bootloader.0kb.upload.tool=arduino:openocd
electroniccats_magspoofv3.menu.bootloader.0kb.upload.use_1200bps_touch=false
electroniccats_magspoofv3.menu.bootloader.0kb.upload.wait_for_upload_port=false
electroniccats_magspoofv3.menu.bootloader.0kb.upload.native_usb=false
electroniccats_magspoofv3.menu.bootloader.0kb.upload.maximum_size=16384
electroniccats_magspoofv3.menu.usb.cdc=CDC_ONLY
electroniccats_magspoofv3.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_magspoofv3.menu.usb.cdc.build.pid=0xBAB5
electroniccats_magspoofv3.menu.usb.cdc_hid=CDC_HID
electroniccats_magspoofv3.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_magspoofv3.menu.usb.cdc_hid.build.pid=0xBAB5
electroniccats_magspoofv3.menu.usb.withcdc=WITH_CDC
electroniccats_magspoofv3.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_magspoofv3.menu.usb.withcdc.build.pid=0xBAB5
electroniccats_magspoofv3.menu.usb.hid=HID_ONLY
electroniccats_magspoofv3.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_magspoofv3.menu.usb.hid.build.pid=0xBAB5
electroniccats_magspoofv3.menu.usb.nocdc=WITHOUT_CDC
electroniccats_magspoofv3.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_magspoofv3.menu.usb.nocdc.build.pid=0xBAB5
electroniccats_magspoofv3.menu.usb.none=USB_DISABLED
electroniccats_magspoofv3.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_magspoofv3.menu.usb.none.build.pid=0xBAB5

# Electronic BastFamily based on SAMR34

