maxgerhardt/pio-electroniccats-samd/boards.txt
electroniccats_huntercat_nfc.name=Electronic Cats Hunter Cat NFC
electroniccats_huntercat_nfc.vid.0=0x1209
electroniccats_huntercat_nfc.pid.0=0x7150
electroniccats_huntercat_nfc.vid.1=0x1209
electroniccats_huntercat_nfc.pid.1=0x7150
electroniccats_huntercat_nfc.upload.tool=bossac
electroniccats_huntercat_nfc.upload.protocol=sam-ba
electroniccats_huntercat_nfc.upload.maximum_size=262144
electroniccats_huntercat_nfc.upload.offset=0x2000
electroniccats_huntercat_nfc.upload.use_1200bps_touch=true
electroniccats_huntercat_nfc.upload.wait_for_upload_port=true
electroniccats_huntercat_nfc.upload.native_usb=true
electroniccats_huntercat_nfc.build.mcu=cortex-m0plus
electroniccats_huntercat_nfc.build.mathlib=arm_cortexM0l_math
electroniccats_huntercat_nfc.build.f_cpu=48000000L
electroniccats_huntercat_nfc.build.usb_product="Hunter Cat NFC"
electroniccats_huntercat_nfc.build.usb_manufacturer="Electronic Cats"
electroniccats_huntercat_nfc.build.board=huntercat_nfc
electroniccats_huntercat_nfc.build.core=arduino
electroniccats_huntercat_nfc.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_huntercat_nfc.build.ldscript=flash_256KB.ld
electroniccats_huntercat_nfc.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_huntercat_nfc.build.variant=huntercat_nfc
electroniccats_huntercat_nfc.build.variant_system_lib=
electroniccats_huntercat_nfc.build.vid=0x1209
electroniccats_huntercat_nfc.build.pid=0x7150
electroniccats_huntercat_nfc.bootloader.tool=openocd
electroniccats_huntercat_nfc.bootloader.file=huntercat_nfc/bootloader-huntercat_nfc-v3.5.0.bin
electroniccats_huntercat_nfc.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_huntercat_nfc.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_huntercat_nfc.menu.float.print=Print uses separate singles and doubles
electroniccats_huntercat_nfc.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_huntercat_nfc.menu.float.string=String uses separate singles and doubles
electroniccats_huntercat_nfc.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_huntercat_nfc.menu.float.both=Print & String use separate singles and doubles
electroniccats_huntercat_nfc.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_huntercat_nfc.menu.config.disabled=config.h disabled
electroniccats_huntercat_nfc.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_huntercat_nfc.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_huntercat_nfc.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_huntercat_nfc.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_huntercat_nfc.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_huntercat_nfc.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_huntercat_nfc.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_huntercat_nfc.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_huntercat_nfc.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_huntercat_nfc.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_huntercat_nfc.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_huntercat_nfc.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_huntercat_nfc.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_huntercat_nfc.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_huntercat_nfc.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_huntercat_nfc.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_huntercat_nfc.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_huntercat_nfc.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_huntercat_nfc.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_huntercat_nfc.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_huntercat_nfc.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_huntercat_nfc.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_huntercat_nfc.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_huntercat_nfc.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_huntercat_nfc.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_huntercat_nfc.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_huntercat_nfc.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_huntercat_nfc.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_huntercat_nfc.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_huntercat_nfc.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_huntercat_nfc.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_huntercat_nfc.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_huntercat_nfc.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_huntercat_nfc.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_huntercat_nfc.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_huntercat_nfc.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_huntercat_nfc.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_huntercat_nfc.menu.bootloader.8kb.upload.tool=bossac
electroniccats_huntercat_nfc.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_huntercat_nfc.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_huntercat_nfc.menu.bootloader.8kb.upload.native_usb=true
electroniccats_huntercat_nfc.menu.usb.cdc=CDC_ONLY
electroniccats_huntercat_nfc.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_huntercat_nfc.menu.usb.cdc.build.pid=0x7150
electroniccats_huntercat_nfc.menu.usb.cdc_hid=CDC_HID
electroniccats_huntercat_nfc.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_huntercat_nfc.menu.usb.cdc_hid.build.pid=0xBAB8
electroniccats_huntercat_nfc.menu.usb.withcdc=WITH_CDC
electroniccats_huntercat_nfc.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_huntercat_nfc.menu.usb.withcdc.build.pid=0x7150
electroniccats_huntercat_nfc.menu.usb.hid=HID_ONLY
electroniccats_huntercat_nfc.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_huntercat_nfc.menu.usb.hid.build.pid=0x7150
electroniccats_huntercat_nfc.menu.usb.nocdc=WITHOUT_CDC
electroniccats_huntercat_nfc.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_huntercat_nfc.menu.usb.nocdc.build.pid=0x7150
electroniccats_huntercat_nfc.menu.usb.none=USB_DISABLED
electroniccats_huntercat_nfc.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_huntercat_nfc.menu.usb.none.build.pid=0x7150